//1. Потрібно створити клас «Телевізійний канал»
//Даний клас потрібний для виконання з 1 по 4 –те завдання
//даний клас має містити наступні поля:
//1.    vector для збереження передач, фільмів і т. д., де кожним елементом вектора є передач, фільмів і т. д. ;
//2.    vector для збереження часу початку передачі, фільму і т.д., де кожним елементом вектора є передач, фільмів і т. д.;
//3.    назва каналу;
//4.    тип каналу(спортивний, інформаційний, музичний…);
//
//даний клас має містити наступні методи:
//1.    Конструктори;
//2.    Деструктор;
//даний клас має містити наступні оператори:
//1. оператор воду;
//2. оператор виводу;
//3. оператори порівняння (<, >, ==, != ).
//
//3.    Необхідно створити наступні функції:
//1.    Функцію №1. Дана функція має приймати масив об’єктів класу «Телевізійний канал» і виводити інформацію про них на консоль.
//
//2.    Функцію №2. Дана функція приймає масив об’єктів класу «Телевізійний канал» і сортує даний масив по каналах по зростанню чи поспадаю за допомогою алгоритму sort(). Данному алгоритму необхідно передати предикат (функцію порівняння), яка і буде вказувати, як саме має сортуватися даний масив.
//
//3.    Функція №3. Дана функція перегружає функцію №1 приймаючи додатковий параметр (назву каналу) і виводить інформацію тільки по заданому каналу.
//
//4.    Функцію №4. Дана функція має приймати має масив об’єктів класу «Телевізійний канал» і назву каналу який потрібно посортувати. По назві каналу знаходимо відповідний канал (який зберігається в контейнері vector) і викликаємо алгоритм sort().
//5.    Функцію №5, яка приймає масив об’єктів класу «Телевізійний канал» і за допомогою алгоритму count_if() знаходимо кількість спортивних каналів, музичних, інформаційних, та інших. Вданий алгоритм необхідно передати предикат, який буде визначати за якої умови потрібно рахувати.
//6.    Функцію №6, яка приймає масив об’єктів класу «Телевізійний канал» і назву програми, фільму і т.д. який необхідно знайти. Дана функція за допомогою алгоритму find_if() робить пошук по кожному каналі і виводить результат на консоль. Дана функція має робити пошук, як по повному спів падінні назви програм, фільмів так і при частковому. Тому для алгоритму find_if() потрібно написати предикат.
//Наприклад, я хочу знати на якийх каналах є футбол. Я ввожу слово футбол, а результатом пошукує всі програми в яких зустрічається слово футбол.
//
//4.    В функції main() :
//•    Для виконання 1-го завдання. Створити масив об’єктів класу Телевізійний канал мінімум 6 каналів передати їх в функцію №1.
//•    Для виконання 2-го завдання. Викликати функцію №2 передавши її необхідні параметри після чого знов викликати функцію №1.
//•    Для виконання 3-го завдання. Викликати функцію №3 передавши її масив об’єктів і канал;
//•    Для виконання 4-го завдання. Викликаємо функцію №4 передавши її масив і назву каналу. Після цього викликаємо функцію № 3 з такими самими параметрами. Виконати всі завдання задані в постановці задачі.
//•    Для виконання 5-го завдання. Викликаємо функцію №5 передавши її масив.
//•    Для виконання 6-го завдання. Викликаємо функцію №5 передавши її масив і назву програми чи фільму які необхідно знайти.

